INSERT INTO `dictionary_academic_rank` (name) VALUES
('доцент'),
('професор');

INSERT INTO `dictionary_base` (name) VALUES
('молодший спеціаліст'),
('повної загальної середньої освіти'),
('бакалавр'),
('магістр');

INSERT INTO `dictionary_cipher` (name, speciality_code) VALUES
('KI',123),
('KIу',NULL),
('KIм',NULL),
('KE',121),
('KEу',NULL),
('KEм',NULL);

INSERT INTO `dictionary_degree` (name) VALUES
('кандидат тех. наук'),
('кандидат фіз-мат наук'),
('доктор тех. наук'),
('доктор фіз-мат наук');

INSERT INTO `dictionary_department` (name, abbreviation) VALUES
('КЕО','КЕО'),
('РФВ','РФВ'),
('ІСІ','ІСІ'),
('ТБЖ','ТБЖ'),
('СФІ','СФІ'),
('УУМ','УУМ'),
('УІТ','УІТ'),
('ЮТД','ЮТД'),
('ЕЗП','ЕЗП'),
('КЕФ','КЕФ'),
('ММА','ММА'),
('ПОМ','ПОМ'),
('КТС','КТС'),
('УАН/УГФ/УРФ','УАН/УГФ/УРФ'),
('ДЗП','ДЗП'),
('ВВВ','ВВВ');

INSERT INTO `dictionary_discipline_form` (name) VALUES
('лекції'),
('лабораторні'),
('практичні зняття');

INSERT INTO `dictionary_discipline_type` (name) VALUES
('Цикл загальної підготовки'),
('Цикл професійної підготовки'),
('Вибіркові компоненти');

INSERT INTO `dictionary_individual_task` (name) VALUES
('КП'),
('КР'),
('кмр'),
('рр'),
('ргр'),
('ао');

INSERT INTO `dictionary_position` (name) VALUES
('асистент'),
('доцент'),
('професор');

INSERT INTO `dictionary_qualification` (name) VALUES
('бакалавр'),
('магистр'),
('доктор філософії');

INSERT INTO `dictionary_reporting_form` (name) VALUES
('екзамен'),
('залік'),
('диф. залік');

INSERT INTO `dictionary_step` (name) VALUES
('бакалавра'),
('магістра'),
('за третім (освітньо-науковим) рівнем');

INSERT INTO `dictionary_studying_form` (name) VALUES
('денна'),
('верірня'),
('заочна');

INSERT INTO `dictionary_studying_term` (name, term_in_month, semester_num) VALUES
('3 роки 10 місяців',48,8),
('2 роки 10 місяців',36,6),
('1 рік 10 місяців',24,4),
('1 рік 5 місяців',13,3);

INSERT INTO `dictionary_studying_type` (name, letter_mean) VALUES
('теоретичне навчання','.т'),
('екзаменаційна сесія','Е'),
('канікули','К'),
('практика','п'),
('атестація','А'),
('самостійна робота','.с'),
('виконання кваліфікаційного проекту (роботи)','Д'),
('захист кваліфікаційного проекту (роботи)','да'),
('складання кваліфікаційного екзамену',''),
('викладаціка практика та наукова діяльність',''),
('наукова діяльність',''),
('навчальна практика','Н'),
('виробнича практика','П');

INSERT INTO `dictionary_subject_name` (name) VALUES
('Програмування'),
('Організація баз даних'),
('Філософія'),
('Інженерна графіка'),
('Системне програмне забезпечення'),
('Фізична культура'),
('Історія та культура України'),
('Безпека життедіяльності та цивільний захист'),
('Українська мова за професійним спрямуванням'),
('Іноземна мова (англійська  / німецька / французська)*'),
('Реалізація прав, свобод і обов`язків громадянина України'),
('Психологія особистісного зростання'),
('Фізика'),
('Вища математика'),
('Дискретна математика'),
('Курсова робота з дисципліни "Програмування"'),
('Програмні та інструментальні засоби web-дизайну'),
('Організація функціонування комп`ютерів'),
('Прикладна теорія електричних кіл для комп`ютерних систем'),
('Комп`ютерна логіка'),
('Курсовий проект з дисципліни "Комп`ютерна логіка"'),
('Системне програмування'),
('Дисципліна 1'),
('Дисципліна 2'),
('Дисципліна 3'),
('Дисципліна 4'),
('Дисципліна 5'),
('Дисципліна 6'),
('Дисципліна 7'),
('Дисципліна 8'),
('Дисципліна 9'),
('Дисципліна 10'),
('Дисципліна 11'),
('Дисципліна 12'),
('Курсовий проект з дисципліни "Системне програмування"'),
('Курсовий проект з дисципліни "Організація баз даних"'),
('Архітектура комп`ютерів'),
('Курсова робота з дисципліни "Системне програмне забезпечення"'),
('Розробка програмного забезпечення на платформі Java'),
('Мережі передачі даних'),
('Комп`ютерна схемотехніка'),
('Комп`ютерні системи'),
('Комп`ютерні мережі'),
('Курсовий проект з дисципліни "Комп`ютерні мережі"'),
('Інженерія програмного забезпечення'),
('Навчальна практика: проектно-технологічна'),
('Виробнича практика: переддипломна'),
('Підготовка та захист кваліфікаційної роботи'),
('Комп`ютерна електроніка'),
('Технології проектування комп`ютерних систем'),
('Захист інформації в комп`ютерних системах'),
('Інженерна комп`ютерна графіка'),
('Безпека життєдіяльності та охорона праці в галузі');

INSERT INTO `users` (username, password, role, status) VALUES
('admin','$2a$12$7UT.BhPVAHBUdzDFG28hVOCcBTt7orvXRoDA8vlUCmeyoA7Pa9hL2','ADMIN','ACTIVE'),
('user','$2a$12$FOok5bYr5ttRDSBTmvxHmO2ZVW7jWyQ2K2PNvFyIAu1DbFzduUCDq','USER','ACTIVE'),
('student','$2a$12$H0iClNPISWllyK4A81g2SOIAkrPi/BhQEmRVW0mbiXM9IwhQWChNm','STUDENT','ACTIVE'),
('teacher','$2a$12$nJka7E3D35rMHKn9CURrbeN7hM0qarwXFt8PJieyBL50oS/oiHmwi','TEACHER','ACTIVE'),
('moderator','$2a$12$GEvBQuwysTbtAjDOS6O3iOzYatZ93csZ9SOPuWR0csf07AXKN1S6G','MODERATOR','ACTIVE');
